// 变量：a，字变量：2
var a = 2

// 表达式：a * 2
var b = a * 2

console.log(a, b, b * 5);


/**
 * 转义符
 * \' = '
 * \" = "
 * \n = 换行
 * \r = 回车
 *
 * \r\n通常连一起用
 */

// ---------------------------------------------------------------------------

/**
 * 
 * 数据类型：
 *  原始类型：number string boolean null undefined
 *      undefined 未定义
 *      null 未设值
 *  引用类型：对象（包含普通对象，数组，函数）
 *      复合型的数据
 * 
 */

/**
 * 对象最终转换
 * 
 * var obj = {
 *  name: 'zs',
 *  age: 12
 * }
 * 
 *  ==> 转换 原始写法
 * var obj = {
 *  'name': 'zs',
 *  'age': 12
 * }
 * 
 * obj.name == 转换 obj['name']
 * 
 * obj.name：语法糖
 */

/**
 * 数组
 * 
 * let list = [2, 4, 5]
 * =====
 * let list = {
 *  0: 2,
 *  1: 4,
 *  2: 5,
 *  length: 3
 * }
 * 
 * 特殊对象，即属性名为下标
 * 
 */

/**
 * 
 */